"""
Βήμα 3. Ευρετήριο (Indexing)

Είσοδος[1]    --> [abstracts]       Μία λίστα με τις περιλήψεις (abstracts) των εργασιών που συλλέξαμε στο 'Βήμα 1. Σταχυολογητής (Web Crawler)' και κάναμε προεπεξεργασία κειμένου στο 'Βήμα 2. Προεπεξεργασία κειμένου'
Λειτουργία    -->                   Αντιστοιχίζει κάθε λέξη/όρο με τον αριθμό ή αριθμούς (abs_id) των περιλήψεων (abstract) των εργασιών, στην οποία εμφανίζεται
Έξοδος[1]     --> [inverted_index]  Ανεστραμμένη δομή δεδομένων ευρετηρίου (inverted_index)
    
"""
def create_inverted_index(abstracts):
    
    inverted_index = {}                             # Αρχικοποίηση της ανεστραμμένης δομής δεδομένων ευρετηρίου (δομή λεξικού)
    for doc_id, abstract in enumerate(abstracts):   # Προσπέλαση της λίστας με τις περιλήψεις (abstract) των εργασιών (doc_id --> Θέση της περίληψης στην λίστα, document --> Περίληψη)
        for word in abstract.split():               # Χωρισμός της περίληψης document σε λεκτικές μονάδες και προσπέλαση αυτών. Η προεπεξεργασία κειμένου έχει γίνει οπότε αρκεί η str.split() αντί της nltk.word_tokenize() για τον χωρισμό
            if word not in inverted_index:          # O όρος κλειδί (word) δεν υπάρχει στο ευρετήριο 
                inverted_index[word] = set()        # Το ευρετήριο είναι ένα λεξικό οπότε ορίζουμε το κλειδί word με κενό περιεχόμενο
            inverted_index[word].add(doc_id)        # Προσθήκη του αριθμού της περίληψης (abs_id) στο περιεχόμενο με κλειδί τον όρο word. Η λέξη word εμφανίζεται στη περίληψη της εργασίας με abs_id

    return inverted_index                           # Επιστροφή της ανεστραμμένης δομής δεδομένων ευρετηρίου (δομή λεξικού)                 

       


