[
    {
        "id": 0,
        "title": "Polarization Leakage and the IXPE PSF",
        "authors": "Jack T. Dinsmore, Roger W. Romani",
        "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM); High Energy Astrophysical Phenomena (astro-ph.HE)",
        "comments": "Accepted to ApJ. 9+3 pages",
        "abstract": "By measuring photoelectron tracks, the gas pixel detectors of the Imaging X-ray Polarimetry Explorer satellite provide estimates of the photon detection location and its electric vector position angle (EVPA). However, imperfections in reconstructing event positions blur the image and EVPA-position correlations result in artificial polarized halos around bright sources. We introduce a new model describing this \"polarization leakage\" and use it to recover the on-orbit telescope point-spread functions, useful for faint source detection and image reconstruction. These point spread functions are more accurate than previous approximations or ground-calibrated products ($\\Delta \\chi^2\\approx 3\\times 10^{4}$ and $4 \\times 10^4$ respectively for a bright $10^6$-count source). We also define an algorithm for polarization leakage correction substantially more accurate than existing prescriptions ($\\Delta \\chi^2\\approx 1\\times 10^{3}$). These corrections depend on the reconstruction method, and we supply prescriptions for the mission-standard \"Moments\" methods as well as for \"Neural Net\" event reconstruction. Finally, we present a method to isolate leakage contributions to polarization observations of extended sources and show that an accurate PSF allows the extraction of sub-PSF-scale polarization patterns.",
        "date": "18 Jan 2024",
        "pdf_url": "https://arxiv.org//pdf/2401.10231.pdf"
    },
    {
        "id": 1,
        "title": "SPARC galaxies prefer Dark Matter over MOND",
        "authors": "Mariia Khelashvili, Anton Rudakovskyi, Sabine Hossenfelder",
        "subjects": "Cosmology and Nongalactic Astrophysics (astro-ph.CO); Astrophysics of Galaxies (astro-ph.GA)",
        "comments": "10 pages, 7 figures",
        "abstract": "We currently have two different hypotheses to solve the missing mass problem: dark matter (DM) and modified Newtonian dynamics (MOND). In this work, we use Bayesian inference applied to the Spitzer Photometry and Accurate Rotation Curves (SPARC) galaxies' rotation curves to see which hypothesis fares better. For this, we represent DM by two widely used cusped and cored profiles, Navarro-Frenk-White (NFW) and Burkert. We parameterize MOND by a widely used radial-acceleration relation (RAR). Our results show a preference for the cored DM profile with high Bayes factors in a substantial fraction of galaxies. Interestingly enough, MOND is typically preferred by those galaxies which lack precise rotation curve data. Our study also confirms that the choice of prior has a significant impact on the credible interval of the characteristic MOND acceleration. Overall, our analysis comes out in favor of dark matter.",
        "date": "18 Jan 2024",
        "pdf_url": "https://arxiv.org//pdf/2401.10202.pdf"
    },
    {
        "id": 2,
        "title": "Highly-coherent quasi-periodic oscillations in the 'heartbeat' black hole X-ray binary IGR J17091-3624",
        "authors": "Jingyi Wang, Erin Kara, Jeroen Homan, James F. Steiner, Diego Altamirano, Tomaso Belloni, Michiel van der Klis, Adam Ingram, Javier A. García, Guglielmo Mastroserio, Riley Connors, Matteo Lucchini, Thomas Dauser, Joseph Neilsen, Collin Lewin, Ron A. Remillard",
        "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)",
        "comments": "11 pages, 10 figures, 2 tables, accepted to be published in ApJ",
        "abstract": "IGR J17091-3624 is a black hole X-ray binary (BHXB), often referred to as the 'twin' of GRS 1915+105 because it is the only other known BHXB that can show exotic 'heartbeat'-like variability that is highly structured and repeated. Here we report on observations of IGR J17091-3624 from its 2022 outburst, where we detect an unusually coherent quasi-periodic oscillation (QPO) when the broadband variability is low (total fractional rms $\\lesssim$ 6%) and the spectrum is dominated by the accretion disk. Such spectral and variability behavior is characteristic of the soft state of typical BHXBs (i.e., those that do not show heartbeats), but we also find that this QPO is strongest when there is some exotic heartbeat-like variability (so-called Class V variability). This QPO is detected at frequencies between 5 and 8 Hz and has Q-factors (defined as the QPO frequency divided by the width) $\\gtrsim$ 50, making it one of the most highly coherent low-frequency QPO ever seen in a BHXB. The extremely high Q factor makes this QPO distinct from typical low-frequency QPOs that are conventionally classified into Type-A/B/C QPOs. Instead, we find evidence that archival observations of GRS 1915+105 also showed a similarly high-coherence QPO in the same frequency range, suggesting that this unusually coherent and strong QPO may be unique to BHXBs that can exhibit 'heartbeat'-like variability.",
        "date": "18 Jan 2024",
        "pdf_url": "https://arxiv.org//pdf/2401.10195.pdf"
    },
    {
        "id": 3,
        "title": "The 2022 Outburst of IGR J17091-3624: Connecting the exotic GRS 1915+105 to standard black hole X-ray binaries",
        "authors": "Jingyi Wang, Erin Kara, Javier A. García, Diego Altamirano, Tomaso Belloni, James F. Steiner, Michiel van der Klis, Adam Ingram, Guglielmo Mastroserio, Riley Connors, Matteo Lucchini, Thomas Dauser, Joseph Neilsen, Collin Lewin, Ron A. Remillard, Jeroen Homan",
        "subjects": "High Energy Astrophysical Phenomena (astro-ph.HE)",
        "comments": "23 pages, 15 figures, 2 tables, accepted to be published in ApJ",
        "abstract": "While the standard X-ray variability of black hole X-ray binaries (BHXBs) is stochastic and noisy, there are two known BHXBs that exhibit exotic `heartbeat'-like variability in their light curves: GRS 1915+105 and IGR J17091-3624. In 2022, IGR J17091-3624 went into outburst for the first time in the NICER/NuSTAR era. These exquisite data allow us to simultaneously track the exotic variability and the corresponding spectral features with unprecedented detail. We find that as in typical BHXBs, the outburst began in the hard state, then the intermediate state, but then transitioned to an exotic soft state where we identify two types of heartbeat-like variability (Class V and a new Class X). The flux-energy spectra show a broad iron emission line due to relativistic reflection when there is no exotic variability, and absorption features from highly ionized iron when the source exhibits exotic variability. Whether absorption lines from highly ionized iron are detected in IGR J17091-3624 is not determined by the spectral state alone, but rather is determined by the presence of exotic variability; in a soft spectral state, absorption lines are only detected along with exotic variability. Our finding indicates that IGR J17091-3624 can be seen as a bridge between the most peculiar BHXB GRS 1915+105 and `normal' BHXBs because it alternates between the conventional and exotic behavior of BHXBs. We discuss the physical nature of the absorbing material and exotic variability in light of this new legacy dataset.",
        "date": "18 Jan 2024",
        "pdf_url": "https://arxiv.org//pdf/2401.10192.pdf"
    },
    {
        "id": 4,
        "title": "New-generation Maximum Entropy Method (ngMEM): a Lagrangian-based algorithm for dynamic reconstruction of interferometric data",
        "authors": "A. Mus, I. Martí-Vidal",
        "subjects": "Instrumentation and Methods for Astrophysics (astro-ph.IM)",
        "comments": " ",
        "abstract": "Imaging interferometric data in radio astronomy requires the use of non-linear algorithms that rely on different assumptions on the source structure and may produce non-unique results. This is especially true for Very Long Baseline Interferometry (VLBI) observations, where the sampling of Fourier space is very sparse. A basic tenet in standard VLBI imaging techniques is to assume that the observed source structure does not evolve during the observation. However, the recent VLBI results of the supermassive black hole (SMBH) at our Galactic Center (Sagittarius A$^*$, SgrA*), recently reported by the Event Horizon Telescope Collaboration (EHTC), require the development of dynamic imaging algorithms, since it exhibits variability at minute timescales. In this paper, we introduce a new non-convex optimization problem that extends the standard Maximum Entropy Method (MEM), for reconstructing intra-observation dynamical images from interferometric data that evolves in every integration time. We present a rigorous mathematical formalism to solve the problem via the primal-dual approach. We build a Newton strategy and we give its numerical complexity. We also give a strategy to iteratively improve the obtained solution and finally, we define a novel figure of merit to evaluate the quality of the recovered solution. Then, we test the algorithm, called ngMEM, in different synthetic datasets, with increasing difficulty. Finally, we compare it with another well-established dynamical imaging method. Within this comparison we identified a significant improvement of the ngMEM reconstructions. Moreover, the evaluation of the integration time evolution scheme and the time contribution showed to play a crucial role for obtaining good dynamic reconstructions.",
        "date": "18 Jan 2024",
        "pdf_url": "https://arxiv.org//pdf/2401.10177.pdf"
    }
]